Revit 2027 API
BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletError Property
 Fillet cannot be created between rail segment since the radius is lower than the profile size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailProfileLowerThanFilletError { get; }
Public Shared ReadOnly Property RailProfileLowerThanFilletError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailProfileLowerThanFilletError {
	FailureDefinitionId^ get ();
}
static member RailProfileLowerThanFilletError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace